export const russian = {
  WELCOME_PAGE_TITLE: 'Выбери язык, чтобы начать игру',
  WELCOME_PAGE_PLAY_BUTTON: 'Начать игру',

  LOADING_PAGE_TITLE: 'Загрузка моделей...',
  LOADING_PAGE_DESCRIPTION:
    'Пожалуйста, подождите, пока мы загружаем модели игры. Это может занять некоторое время.',

  INTRODUCTION_PAGE_TITLE: 'Добро пожаловать, исследователи времени!',
  INTRODUCTION_PAGE_DESCRIPTION:
    'Таинственный сбой нарушил ход истории - от динозавров до будущего! Твоя задача - путешествовать во времени, решать головоломки и восстанавливать прошлое, прежде чем станет слишком поздно. Нажми, чтобы начать свое путешествие. Удачи... история зависит от тебя! 🚀',
  INTRODUCTION_PAGE_PLAY_BUTTON: 'ИГРАТЬ',

  SIGNUP_PAGE_TITLE: 'Создай свою команду',
  SIGNUP_INPUT_NAME_PLACEHOLDER: 'Введи название своей команды',
  SIGNUP_INPUT_SIZE_PLACEHOLDER: 'Введи размер своей команды',
  SIGNUP_PAGE_BUTTON: 'Создать команду',
  SIGNUP_PAGE_ERROR: 'Пожалуйста, заполни все поля',

  GAME_PAGE_TITLE: 'Добро пожаловать в Time Trek: Пропавшая временная линия',
  GAME_PAGE_DESCRIPTION:
    'Приготовьтесь к захватывающему приключению во времени! Кто-то нарушил прошлое, и только вы можете это исправить. Сканируя QR-коды, спрятанные в парке, вы будете прыгать между различными историческими периодами - от динозавров до будущего - и решать головоломки и задачи, чтобы восстановить историю!',
  GAME_PAGE_BUTTON: 'Сканируйте QR-код, чтобы начать',
  GAME_PAGE_HOW_IT_WORKS: 'Как это работает:',
  GAME_PAGE_HOW_IT_WORKS_LIST: [
    '1. Сканируй QR-код, чтобы начать свое приключение.',
    '2. На каждой остановке тебе предстоит столкнуться с головоломкой или задачей из другой эпохи.',
    '3. Реши задачу, чтобы открыть следующее местоположение.',
    '4. Выполни миссию, чтобы выиграть приз и стать сертифицированным исследователем времени!',
  ],

  QUIZZ_INCORRECT_ANSWER: 'Неправильный ответ, попробуй еще раз!',
  QUIZZ_CORRECT_ANSWER: 'Правильный ответ! Отличная работа!',
  QUIZZ_TYPE_YOUR_ANSWER: 'Введите свой ответ тут',
  QUIZZ_NEXT_QUESTION: 'Следующий вопрос',
  QUIZZ_CHECK_ANSWER: 'Проверить ответ',

  PREHISTORIC_PAGE_TITLE: 'Доисторическая эпоха',
  PREHISTORIC_QUIZZ_QUESTION_HINT_WARNING_TITLE:
    'Вы уверены, что хотите получить подсказку?',
  PREHISTORIC_QUIZZ_QUESTION_HINT_WARNING_DESCRIPTION:
    'Это будет стоить вам 50 очков!',
  PREHISTORIC_QUIZZ_QUESTION_SURRENDER_WARNING_TITLE:
    'Вы уверены, что хотите сдаться?',
  PREHISTORIC_QUIZZ_QUESTION_SURRENDER_WARNING_DESCRIPTION:
    'Это действие нельзя отменить. Вы потеряете 100 очков.',
  PREHISTORIC_QUIZZ_QUESTION_1: 'Гигантских ящеров прошлого называли ___',
  PREHISTORIC_QUIZZ_QUESTION_1_HINT:
    'Они бродили по Земле миллионы лет назад и часто изображаются в фильмах.',
  PREHISTORIC_QUIZZ_ANSWER_1: 'динозавры',
  PREHISTORIC_QUIZZ_QUESTION_2:
    'Чего-то не хватает в этой ранней сцене - что использовали люди, чтобы согреться и готовить?',
  PREHISTORIC_QUIZZ_QUESTION_2_HINT:
    'Это то, что можно найти в природе и что необходимо для выживания.',
  PREHISTORIC_QUIZZ_ANSWER_2: 'огонь',
  PREHISTORIC_QUIZZ_QUESTION_3:
    'Я пролетел через космос и вызвал шум, положив конец правлению тех, кто имел значение. Что я?',
  PREHISTORIC_QUIZZ_QUESTION_3_HINT:
    'Я небесный объект, который может вызвать массовое вымирание.',
  PREHISTORIC_QUIZZ_ANSWER_3: 'астероид',

  NEW_STEP_TITLE_1: 'Поздравляем, вы завершили один из шагов игры!',
  NEW_STEP_TITLE_2: 'Вы открыли новое местоположение.',
  NEW_STEP_TITLE_3: 'Теперь вы можете перейти к следующему шагу 👣',
  NEW_STEP_SCAN_BUTTON: 'Сканировать QR-код',

  OOPSIE_PAGE_TITLE: 'Упс! Похоже, что-то пошло не так. Попробуйте снова.',
  OOPSIE_PAGE_BUTTON: 'Вернуться к предыдущему шагу',

  EGYPT_PAGE_TITLE: 'Египетская эпоха',

  MEDIEVAL_PAGE_TITLE: 'Средневековая эпоха',

  VICTORIAN_PAGE_TITLE: 'Викторианская эпоха',

  '1980_PAGE_TITLE': 'Эпоха 1980-х',
};
