export const russian = {
  WELCOME_PAGE_TITLE: 'Выбери язык, чтобы начать игру',
  WELCOME_PAGE_PLAY_BUTTON: 'Начать игру',

  LOADING_PAGE_TITLE: 'Загрузка моделей...',
  LOADING_PAGE_DESCRIPTION:
    'Пожалуйста, подождите, пока мы загружаем модели игры. Это может занять некоторое время.',

  NOT_FOUND_TITLE: 'Похоже, вы потерялись во временном вакууме...',
  NOT_FOUND_DESCRIPTION:
    'Страница, которую вы ищете, не существует. Пожалуйста, проверьте URL или вернитесь на главную страницу.',
  NOT_FOUND_BUTTON: 'Вернуться к контрольной точке',

  INTRODUCTION_PAGE_TITLE: 'Добро пожаловать, исследователи времени!',
  INTRODUCTION_PAGE_DESCRIPTION:
    'Таинственный сбой нарушил ход истории - от динозавров до будущего! Твоя задача - путешествовать во времени, решать головоломки и восстанавливать прошлое, прежде чем станет слишком поздно. Нажми, чтобы начать свое путешествие. Удачи... история зависит от тебя! 🚀',
  INTRODUCTION_PAGE_PLAY_BUTTON: 'ИГРАТЬ',

  SIGNUP_PAGE_TITLE: 'Создай свою команду',
  SIGNUP_INPUT_NAME_PLACEHOLDER: 'Введи название своей команды',
  SIGNUP_INPUT_SIZE_PLACEHOLDER: 'Введи размер своей команды',
  SIGNUP_PAGE_BUTTON: 'Создать команду',
  SIGNUP_PAGE_ERROR: 'Пожалуйста, заполни все поля',

  GAME_PAGE_TITLE: 'Добро пожаловать в Time Trek: Пропавшая временная линия',
  GAME_PAGE_DESCRIPTION:
    'Приготовьтесь к захватывающему приключению во времени! Кто-то нарушил прошлое, и только вы можете это исправить. Сканируя QR-коды, спрятанные в парке, вы будете прыгать между различными историческими периодами - от динозавров до будущего - и решать головоломки и задачи, чтобы восстановить историю!',
  GAME_PAGE_BUTTON: 'Сканируйте QR-код, чтобы начать',
  GAME_PAGE_HOW_IT_WORKS: 'Как это работает:',
  GAME_PAGE_HOW_IT_WORKS_LIST: [
    '1. Сканируй QR-код, чтобы начать свое приключение.',
    '2. На каждой остановке тебе предстоит столкнуться с головоломкой или задачей из другой эпохи.',
    '3. Реши задачу, чтобы открыть следующее местоположение.',
    '4. Выполни миссию, чтобы выиграть приз и стать сертифицированным исследователем времени!',
  ],

  QUIZZ_INCORRECT_ANSWER: 'Неправильный ответ, попробуй еще раз!',
  QUIZZ_CORRECT_ANSWER: 'Правильный ответ! Отличная работа!',
  QUIZZ_TYPE_YOUR_ANSWER: 'Введите свой ответ тут',
  QUIZZ_NEXT_QUESTION: 'Следующий вопрос',
  QUIZZ_CHECK_ANSWER: 'Проверить ответ',

  QUIZZ_QUESTION_HINT_WARNING_TITLE:
    'Вы уверены, что хотите получить подсказку?',
  QUIZZ_QUESTION_HINT_WARNING_DESCRIPTION: 'Это будет стоить вам 50 очков!',
  QUIZZ_QUESTION_SURRENDER_WARNING_TITLE: 'Вы уверены, что хотите сдаться?',
  QUIZZ_QUESTION_SURRENDER_WARNING_DESCRIPTION:
    'Это действие нельзя отменить. Вы потеряете 100 очков.',
  QUIZZ_QUESTION_SELECT_WARNING:
    'У вас есть только один шанс ответить на этот вопрос',
  QUIZZ_QUESTION_REBUS: 'Разгадайте ребус',
  QUIZZ_QUESTION_MAZE: 'Разгадайте лабиринт',

  PREHISTORIC_PAGE_TITLE: 'Доисторическая эпоха',
  PREHISTORIC_QUIZZ_QUESTION_1: 'Гигантских ящеров прошлого называли ___',
  PREHISTORIC_QUIZZ_QUESTION_1_HINT:
    'Они бродили по Земле миллионы лет назад и часто изображаются в фильмах.',
  PREHISTORIC_QUIZZ_ANSWER_1: 'динозавры',
  PREHISTORIC_QUIZZ_QUESTION_2:
    'Чего-то не хватает в этой ранней сцене - что использовали люди, чтобы согреться и готовить?',
  PREHISTORIC_QUIZZ_QUESTION_2_HINT:
    'Это то, что можно найти в природе и что необходимо для выживания.',
  PREHISTORIC_QUIZZ_ANSWER_2: 'огонь',
  PREHISTORIC_QUIZZ_QUESTION_3:
    'Я пролетел через космос и вызвал шум, положив конец правлению тех, кто имел значение. Что я?',
  PREHISTORIC_QUIZZ_QUESTION_3_HINT:
    'Я небесный объект, который может вызвать массовое вымирание.',
  PREHISTORIC_QUIZZ_ANSWER_3: 'астероид',

  NEW_STEP_TITLE_1: 'Поздравляем, вы завершили один из шагов игры!',
  NEW_STEP_TITLE_2: 'Вы открыли новое местоположение.',
  NEW_STEP_TITLE_3: 'Теперь вы можете перейти к следующему шагу 👣',
  NEW_STEP_SCAN_BUTTON: 'Сканировать QR-код',

  OOPSIE_PAGE_TITLE:
    'Упс! Кажется, вы заблудились в джунглях. Пожалуйста, вернитесь назад и выполните предыдущий шаг, прежде чем продолжить свое приключение',
  OOPSIE_PAGE_BUTTON: 'Вернуться к предыдущему шагу',

  EGYPT_PAGE_TITLE: 'Египетская эпоха',
  EGYPT_QUIZZ_QUESTION_1:
    'Я - великий треугольник в пустыне, где отдыхают фараоны и обитают тайны. Что я?',
  EGYPT_QUIZZ_QUESTION_1_HINT:
    'Я - величественная гробница, построенная из огромных камней, и я охраняю секреты древнего мира.',
  EGYPT_QUIZZ_ANSWER_1: 'пирамида',
  EGYPT_QUIZZ_QUESTION_2: 'Как звали египетских царей?',
  EGYPT_QUIZZ_QUESTION_2_HINT:
    'Их часто хоронили в величественных гробницах, и их имена известны до сих пор.',
  EGYPT_QUIZZ_ANSWER_2: 'фараоны',
  EGYPT_QUIZZ_QUESTION_3: 'У меня голова сокола, и я охраняю царей. Кто я?',
  EGYPT_QUIZZ_QUESTION_3_HINT:
    'Я - мифическое существо, которое сочетает в себе человеческие и животные черты.',
  EGYPT_QUIZZ_ANSWER_3: 'гор',
  EGYPT_QUIZZ_SELECT_OPTION_1: 'Анубис',
  EGYPT_QUIZZ_SELECT_OPTION_2: 'Гор',
  EGYPT_QUIZZ_SELECT_OPTION_3: 'Осирис',
  EGYPT_QUIZZ_SELECT_OPTION_4: 'Ра',

  MEDIEVAL_PAGE_TITLE: 'Средневековая эпоха',
  MEDIEVAL_QUIZZ_QUESTION_1:
    'Я - величественное сооружение, где рыцари сражаются и принцессы ждут. Что я?',
  MEDIEVAL_QUIZZ_QUESTION_1_HINT:
    'Я - крепость, защищенная стенами, где происходят великие сражения и романтические истории.',
  MEDIEVAL_QUIZZ_ANSWER_1: 'замок',
  MEDIEVAL_QUIZZ_QUESTION_2:
    'Я ношу доспехи и скачу в бой. Я служу своему королю с отвагой. Кто я?',
  MEDIEVAL_QUIZZ_QUESTION_2_HINT: 'Я - воин чести, с древними историями.',
  MEDIEVAL_QUIZZ_ANSWER_2: 'рыцарь',
  MEDIEVAL_QUIZZ_QUESTION_3:
    'Что использовали лучники для нанесения дальних атак?',
  MEDIEVAL_QUIZZ_QUESTION_3_HINT:
    'Я - точное оружие, с тетивой и стрелой для игры.',
  MEDIEVAL_QUIZZ_ANSWER_3: 'лук',
  MEDIEVAL_QUIZZ_SELECT_OPTION_1: 'Меч',
  MEDIEVAL_QUIZZ_SELECT_OPTION_2: 'Ударная дубина',
  MEDIEVAL_QUIZZ_SELECT_OPTION_3: 'Арбалет',
  MEDIEVAL_QUIZZ_SELECT_OPTION_4: 'Лук',

  VICTORIAN_PAGE_TITLE: 'Викторианская эпоха',
  VICTORIAN_QUIZZ_QUESTION_1:
    'Какой из этих предметов не использовался в викторианскую эпоху?',
  VICTORIAN_QUIZZ_QUESTION_1_HINT:
    'Это устройство - современное изобретение, которое революционизировало связь.',
  VICTORIAN_QUIZZ_ANSWER_1: 'смартфон',
  VICTORIAN_QUIZZ_SELECT_OPTION_1: 'Газовая лампа',
  VICTORIAN_QUIZZ_SELECT_OPTION_2: 'Смартфон',
  VICTORIAN_QUIZZ_SELECT_OPTION_3: 'Печатная машинка',
  VICTORIAN_QUIZZ_SELECT_OPTION_4: 'Паровой двигатель',
  VICTORIAN_QUIZZ_QUESTION_2_HINT:
    'Это вид транспорта, который был популярен в викторианскую эпоху.',
  VICTORIAN_QUIZZ_ANSWER_2: 'поезд',
  VICTORIAN_QUIZZ_QUESTION_3_HINT:
    'Это устройство, которое использовалось для освещения улиц и домов.',
  VICTORIAN_QUIZZ_ANSWER_3: 'лампа',
  VICTORIAN_QUIZZ_IMAGE_SRC: '/images/victorian-maze-ru.png',

  '1980_PAGE_TITLE': 'Эпоха 1980-х',
  '1980_QUIZZ_QUESTION_1':
    'Какой боксер-профессионал провел свой последний бой в 1980 году?',
  '1980_QUIZZ_QUESTION_1_HINT':
    'Он был известен своей невероятной скоростью и силой, а также был чемпионом мира.',
  '1980_QUIZZ_ANSWER_1': 'мухаммед али',
  '1980_QUIZZ_SELECT_OPTION_1': 'Майк Тайсон',
  '1980_QUIZZ_SELECT_OPTION_2': 'Мухаммед Али',
  '1980_QUIZZ_SELECT_OPTION_3': 'Шугар Рэй Леонард',
  '1980_QUIZZ_SELECT_OPTION_4': 'Джордж Форман',
  '1980_QUIZZ_QUESTION_2_HINT':
    'Это популярный персонаж видеоигр из 1980-х годов.',
  '1980_QUIZZ_ANSWER_2': 'пакман',
  '1980_QUIZZ_QUESTION_3_HINT':
    'Это популярная головоломка, которая включает в себя сборку фигур.',
  '1980_QUIZZ_ANSWER_3': 'тетрис',
  '1980_QUIZZ_IMAGE_SRC': '/images/1980-maze-ru.png',

  FUTURE_PAGE_TITLE: 'Эпоха будущего',
  FUTURE_QUIZZ_QUESTION_1:
    'Я - транспортное средство завтрашнего дня, скользящее над улицами, сочетающее свободу неба и удобство дороги. Что я?',
  FUTURE_QUIZZ_QUESTION_1_HINT:
    'Вы можете увидеть меня в фантастических фильмах, за рулем и в полете над пробками. Я не просто машина, я могу парить!',
  FUTURE_QUIZZ_ANSWER_1: 'летающая машина',
  FUTURE_QUIZZ_QUESTION_2_HINT:
    'Я - устройство, которое может летать и доставлять посылки, его часто можно увидеть жужжащим над городами.',
  FUTURE_QUIZZ_ANSWER_2: 'дрон',
  FUTURE_QUIZZ_QUESTION_3_HINT:
    'Я - футуристическое устройство, которое проецирует 3D-изображение в воздух, позволяя вам взаимодействовать с ним, как с реальным.',
  FUTURE_QUIZZ_ANSWER_3: 'голограмма',
  FUTURE_QUIZZ_IMAGE_SRC: '/images/future-maze-ru.png',

  CONGRATULATIONS_PAGE_TITLE: 'Поздравляем,',
  CONGRATULATIONS_PAGE_DESCRIPTION:
    'Вы успешно завершили приключение Time Trek! Вы восстановили историю и стали сертифицированным исследователем времени. За свои старания ваша команда получила специальный приз. Спасибо за игру, и мы надеемся увидеть вас снова в новом приключении! 🚀',
  CONGRATULATIONS_PAGE_TIP:
    'Пожалуйста, держите эту страницу открытой или сделайте скриншот, чтобы получить свой приз на стартовой локации игры.',

  STATISTICS_TITLE: 'Ваше путешествие',
  STATISTICS_TIME_SPENT: 'Затраченное время',
  STATISTICS_TIME_SPENT_HOURS: 'часов',
  STATISTICS_TIME_SPENT_MINUTES: 'минут',
  STATISTICS_TIME_SPENT_SECONDS: 'секунд',
  STATISTICS_POINTS: 'Очки',
  STATISTICS_PREHISTORIC_ERA: 'Доисторическая эпоха',
  STATISTICS_EGYPT_ERA: 'Египетская эпоха',
  STATISTICS_MEDIEVAL_ERA: 'Средневековая эпоха',
  STATISTICS_VICTORIAN_ERA: 'Викторианская эпоха',
  STATISTICS_1980S_ERA: 'Эпоха 1980-х',
  STATISTICS_FUTURE_ERA: 'Эпоха будущего',
  STATISTICS_QUIZZ_QUESTION_1: '1 Вопрос',
  STATISTICS_QUIZZ_QUESTION_2: '2 Вопрос',
  STATISTICS_QUIZZ_QUESTION_3: '3 Вопрос',
};
