export const russian = {
  WELCOME_PAGE_TITLE: 'Выбери язык, чтобы начать игру',
  WELCOME_PAGE_PLAY_BUTTON: 'Начать игру',
  LOADING_PAGE_TITLE: 'Загрузка моделей...',
  LOADING_PAGE_DESCRIPTION:
    'Пожалуйста, подождите, пока мы загружаем модели игры. Это может занять некоторое время.',
  INTRODUCTION_PAGE_TITLE: 'Добро пожаловать, исследователи времени!',
  INTRODUCTION_PAGE_DESCRIPTION:
    'Таинственный сбой нарушил ход истории - от динозавров до будущего! Твоя задача - путешествовать во времени, решать головоломки и восстанавливать прошлое, прежде чем станет слишком поздно. Нажми, чтобы начать свое путешествие. Удачи... история зависит от тебя! 🚀',
  INTRODUCTION_PAGE_PLAY_BUTTON: 'ИГРАТЬ',
  SIGNUP_PAGE_TITLE: 'Создай свою команду',
  SIGNUP_INPUT_NAME_PLACEHOLDER: 'Введи название своей команды',
  SIGNUP_INPUT_SIZE_PLACEHOLDER: 'Введи размер своей команды',
  SIGNUP_PAGE_BUTTON: 'Создать команду',
  SIGNUP_PAGE_ERROR: 'Пожалуйста, заполни все поля',
  GAME_PAGE_TITLE: 'Добро пожаловать в Time Trek: Пропавшая временная линия',
  GAME_PAGE_DESCRIPTION:
    'Приготовьтесь к захватывающему приключению во времени! Кто-то нарушил прошлое, и только вы можете это исправить. Сканируя QR-коды, спрятанные в парке, вы будете прыгать между различными историческими периодами - от динозавров до будущего - и решать головоломки и задачи, чтобы восстановить историю!',
  GAME_PAGE_BUTTON: 'Сканируйте QR-код, чтобы начать',
  GAME_PAGE_HOW_IT_WORKS: 'Как это работает:',
  GAME_PAGE_HOW_IT_WORKS_LIST: [
    '1. Сканируй QR-код, чтобы начать свое приключение.',
    '2. На каждой остановке тебе предстоит столкнуться с головоломкой или задачей из другой эпохи.',
    '3. Реши задачу, чтобы открыть следующее местоположение.',
    '4. Выполни миссию, чтобы выиграть приз и стать сертифицированным исследователем времени!',
  ],
};
